# TextFont

## Description
Procedure TextFont sets the active font for the document.

```pascal
PROCEDURE TextFont(fontID : INTEGER);
```

```python
def vs.TextFont(fontID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fontID|INTEGER|Font ID setting for document.|

## Examples
==== VectorScript ====
```pascal
TextFont(GetFontID('Times'));
```
==== Python ====
```python

```

## Version
Availability: from All Versions

## Category
* Objects - Text